Trusses require both a top and a bottom chord reference (chain of one or more reference lines).
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId TrussMissingReference { get; }
  Visual Basic
Public Shared ReadOnly Property TrussMissingReference As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ TrussMissingReference {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace